FemDesign.Loads.LoadCategory
load_category

FemDesign.Loads.LoadCategory.Name
Name of Load Category.

FemDesign.Loads.LoadCategory.Psi0
𝜓₀ Factor for combination value of a variable action

FemDesign.Loads.LoadCategory.Psi1
𝜓₁ Factor for frequent value of a variable action

FemDesign.Loads.LoadCategory.Psi2
𝜓₂ Factor for quasi-permanent value of a variable action

FemDesign.Loads.LoadCategory.#ctor
Private constructor for serialization

FemDesign.Loads.LoadCategory.#ctor(System.String,System.Double,System.Double,System.Double)
Creates a load category
name: Name of the load category
psi0: 𝜓₀ Factor for combination value of a variable action
psi1: 𝜓₁ Factor for frequent value of a variable action
psi2: 𝜓₂ Factor for quasi-permanent value of a variable action